docs/providers/airblue-ndc-samples/Ancillary NDC API Samples/doBaggageServiceList_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://www.iata.org/IATA/2015/00/2020.1/IATA_ServiceListRQ">
   <soapenv:Header/>
   <soapenv:Body>
      <IATA_ServiceListRQ>
        <Party>
            <Sender>
               <TravelAgency>
                  <AgencyID>SELENS</AgencyID>
                  <ContactInfo>
                     <EmailAddress>
                        <EmailAddressText>sample@hititcs.com</EmailAddressText>
                     </EmailAddress>
                  </ContactInfo>
                  <Name>NDC GATEWAY</Name>
               </TravelAgency>
            </Sender>
         </Party>
         <Request>
           <CoreRequest>
               <Offer>
                  <OfferID>800EDS</OfferID>
               </Offer>
            </CoreRequest>
              <Pax>
              <Birthdate>1990-04-01</Birthdate>
              
              <ContactInfoRefID>Contact-1</ContactInfoRefID>
              <IdentityDoc>
                <IdentityDocID>R53799815</IdentityDocID>
                <IdentityDocTypeCode>PASSPORT</IdentityDocTypeCode>
                <Birthdate>1986-09-08</Birthdate>
                <CitizenshipCountryCode>IR</CitizenshipCountryCode>
                <ExpiryDate>2026-05-19</ExpiryDate>
                <GenderCode>F</GenderCode>
                <GivenName>MARYAM</GivenName>
                <Surname>SHAHBAZINIA</Surname>
              </IdentityDoc>
              <Individual>
                <GenderCode>F</GenderCode>
                <GivenName>MARYAM</GivenName>
                <IndividualID>IND-1</IndividualID>
                <Surname>SHAHBAZINIA</Surname>
                <TitleName>MS</TitleName>
              </Individual>
              <PaxID>ADTPax-403002906</PaxID>
              
              <PTC>ADT</PTC>
            </Pax>
            <Pax>
                     <Birthdate>2017-09-20</Birthdate>
                     <CitizenshipCountryCode>TR</CitizenshipCountryCode>
                     <ContactInfoRefID>Contact-1</ContactInfoRefID>
                     <IdentityDoc>
                        <IdentityDocID>40708640368</IdentityDocID>
                        <IdentityDocTypeCode>NATIONAL_ID</IdentityDocTypeCode>
                     </IdentityDoc>
                     <IdentityDoc>
                        <IdentityDocID>40708640368</IdentityDocID>
                        <IdentityDocTypeCode>PASSPORT</IdentityDocTypeCode>
                        <Birthdate>2017-09-20</Birthdate>
                        <CitizenshipCountryCode>TR</CitizenshipCountryCode>
                        <ExpiryDate>2022-10-10</ExpiryDate>
                        <GenderCode>M</GenderCode>
                        <GivenName>>ESTC</GivenName>
                        <Surname>EST</Surname>
                     </IdentityDoc>
                     <Individual>
                        <GenderCode>M</GenderCode>
                        <GivenName>ESTC</GivenName>
                        <IndividualID>IND-CHD</IndividualID>
                        <Surname>EST</Surname>
                        <TitleName>MR</TitleName>
                     </Individual>
                     <PaxID>PAX-CHD1</PaxID>
                     <PTC>CHD</PTC>
                  </Pax>
            <ResponseParameters>
               <CurParameter>
                  <RequestedCurCode>PKR</RequestedCurCode>
               </CurParameter>
               <Device>
                  <DeviceOwnerTypeCode>SL</DeviceOwnerTypeCode>
               </Device>
               <LangUsage>
                  <LangCode>EN</LangCode>
               </LangUsage>
            </ResponseParameters>
         </Request>
      </IATA_ServiceListRQ>
   </soapenv:Body>
</soapenv:Envelope>